frontend/controllers/SitioController.php

    public function beforeAction($action) {
//        if ($action->id == "agregar-item") {
        $session = Yii::$app->session;
        if ($session['carrito'] == '') {
            $carrito = new \common\models\Carrito();
            $carrito->save();
---
INSERT INTO `carrito` (`id_carrito`) VALUES (DEFAULT)

    public function actionAgregarItemDesdeBuscador() {
        $session = Yii::$app->session;
        $data = \Yii::$app->request->post();
        $id = $data['id'];
        $imagen_id = \common\models\Articulo::findOne($id)->imagen_id ?? null;
        $cantidad = 1;
        $item = new \common\models\ItemCarrito([
            'carrito_id' => $session['carrito'],
            'cantidad' => $cantidad,
            'imagen_id' => $imagen_id,
            'articulo_id' => $id]);
        $item->save();
---
INSERT INTO `item_carrito` (`carrito_id`, `cantidad`, `imagen_id`, `articulo_id`) VALUES (24133, 1, 13088, 12407)

    function actionFinalizarConsulta($categoria_padre = 1, $id_carrito) {
        $carrito = \common\models\Carrito::findOne($id_carrito);
---
SELECT * FROM `carrito` WHERE `id_carrito`=24133