frontend/views/layouts/_modal_pdf.php

            </div>
            <div class="modal-body">
                <?php
                $pdfs = \common\models\PdfReport::find()->where(['publicado'=>true])->orderBy('nombre_pdf')->all();
---
SELECT * FROM `pdf_report` WHERE `publicado`=TRUE ORDER BY `nombre_pdf`