frontend/views/layouts/_modal_movil_menu.php

                            </a>
                        </li>
                        <?php
                        $categorias = \common\models\Categoria::find()->where(['moda' => true])->all();
---
SELECT * FROM `categoria` WHERE `moda`=TRUE

                            </a>
                        </li>
                        <?php
                        $categorias = \common\models\Categoria::find()->where(['hogar' => true])->all();
---
SELECT * FROM `categoria` WHERE `hogar`=TRUE