frontend/views/layouts/footer.php

SELECT * FROM `categoria` WHERE `moda`=TRUE
---

                        <ul class="list-unstyled">
                            <?php
                            $categoriasModa = \common\models\Categoria::find()->where(['moda' => true])->all();

SELECT * FROM `categoria` WHERE `hogar`=TRUE
---
                    <div class="links">
                        <ul class="list-unstyled">
                            <?php
                            $categoriasHogar = \common\models\Categoria::find()->where(['hogar' => true])->all();