frontend/views/layouts/nav1.php


                    <!-- Cart Dropdown-->
                    <?php
                    $carrito = \common\models\Carrito::findOne($_SESSION['carrito']);
---
SELECT * FROM `item_carrito` WHERE `carrito_id`=24134