frontend/views/sitio/_clientePedido.php

SELECT * FROM `cliente` WHERE NOT (`nro_cliente` IS NULL)
---

                <?php
                $data = [];
                $clientes = $model->find()->where(['not', ['nro_cliente' => null]])->all();