frontend/views/sitio/cart.php

SELECT `articulo`.* FROM `articulo` LEFT JOIN `tela` ON `articulo`.`tela_id` = `tela`.`id_tela` WHERE `existencia`=1 ORDER BY `codigo_tela`, `codigo_color`
---
            <div class="col-md-8 m-auto pt-2 buscar-por-tela-variante w-100 m-auto">
                <?php
                $data = [];
                $articulos = common\models\Articulo::find()->joinWith('tela')->where(['existencia' => 1])->orderBy('codigo_tela, codigo_color')->all();

SELECT * FROM `item_carrito` WHERE `carrito_id`=24133
---

<?php
if ($_SESSION['carrito'] != ''):
    $carrito = \common\models\Carrito::findOne($_SESSION['carrito']);