frontend/views/sitio/nav3.php

SELECT * FROM `categoria` WHERE `moda`=TRUE
---
                            </a>
                            <div class="dropdown-menu" aria-labelledby="dropdownMenuLink2">
                                <?php
                                $categoriasModa = \common\models\Categoria::find()->where(['moda'=>true])->all();

SELECT * FROM `categoria` WHERE `hogar`=TRUE
---
                            <div class="dropdown-menu" aria-labelledby="dropdownMenuLink3">

                                <?php
                                $categoriasHogar = \common\models\Categoria::find()->where(['hogar'=>true])->all();